app/views/orders/_form.html.erb

SELECT `caterers`.* FROM `caterers`
---
    <%#= f.text_field :cater %>
    <%= f.collection_select :cater, Caterer.all,:caterername,:caterername, include_blank: true %>