app/controllers/orders_controller.rb

SELECT `depts`.* FROM `depts`
SELECT `confrooms`.* FROM `confrooms`
SELECT `caterers`.* FROM `caterers`
---
  def new
    @order = Order.new
    @depts = Dept.all
    @confrooms = Confroom.all
    @caterers = Caterer.all

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = ? LIMIT 1  [["id", "1"]]
SELECT `depts`.* FROM `depts`
SELECT `confrooms`.* FROM `confrooms`
SELECT `caterers`.* FROM `caterers`
---
  def edit
    @order = Order.find(params[:id])
    @depts = Dept.all
    @confrooms = Confroom.all
    @caterers = Caterer.all

INSERT INTO `orders` (`caterer_id`, `confroom_id`, `created_at`, `credit_card`, `date_of_delivery`, `dept_id`, `food_allergies`, `name`, `no_of_people`, `special_requests`, `updated_at`, `user_id`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @order = Order.new(params[:order])

    respond_to do |format|
      if @order.save

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = ? LIMIT 1  [["id", "1"]]
UPDATE `orders` SET `name` = 'asdfsada', `updated_at` = '2014-10-01 13:15:55' WHERE `orders`.`id` = 1
---
  def update
    @order = Order.find(params[:id])

    respond_to do |format|
      if @order.update_attributes(params[:order])

SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = ? LIMIT 1  [["id", "2"]]
DELETE FROM `orders` WHERE `orders`.`id` = ?  [["id", 2]]
---
  def destroy
    @order = Order.find(params[:id])
    @order.destroy